// Напишите программу
// которая принимает на
//вход три числа и выдаёт максимальное из этих чисел.

double a = 200, b = 100, c = 150;
if (a > b && a > c) 
Console.WriteLine("Nubmer Max = " + a);
else 
if (b > c) 
Console.WriteLine("Number Max = " + b);
else 
Console.WriteLine("Number Max = " + c); Console.ReadLine();